#4.3
for nb in range(1, 21):
    print(nb)
print("----------------------------------------------------------------------------------------")
#4.4
nbb = list(range(1, 100)) #тут надо 101 а не 100
print(nbb)
for nh in nbb:
    print(nh)
print("----------------------------------------------------------------------------------------")
#4.5
kf = list(range(1, 101))
print(kf)
kfn = min(kf)
kfx = max(kf)
print(kfn)
print(kfx)
kfs = sum(kf)
print(kfs)
print("----------------------------------------------------------------------------------------")
#4.6
mn = list(range(1, 21, 2))
for nmm in mn:
    print(nmm)
print("----------------------------------------------------------------------------------------")
#4.7
rk = list(range(3, 31, 3))
for rkk in rk:
    print(rkk)
print("----------------------------------------------------------------------------------------")
#4.8
kubiki = []
for kb in range(1, 11):
    kub = kb ** 3
    kubiki.append(kub)
print(kubiki)
print("----------------------------------------------------------------------------------------")
#4.9
sk = [skk**3 for skk in range(1, 11)]
for lk in sk:
    print(lk)
